---
layout: post
title: 2014年终总结
category: 生活随笔
tags: [年终总结, 生活, 随笔]
keywords: 年终总结, 生活, 随笔
description: 
---

> 时光如水，静默流逝。不知不觉中，一年的光阴流失殆尽，仅以此文记录一年中的琐事，总结过去，畅想未来。

##扬帆起航
初到深圳，感慨生活的艰难，兜兜转转，最终踏上编程之路。
###恒波：2012.12.9 - 2013.2.18
    初到深圳时，面对严峻的就业形势，多次寻找工作未果，只能先找份工作维持生存，当时只是想撑完春节，等到开年3、4月份工作机会多了再做打算。因此在恒波(Nokia)找了份手机销售的工作，正式踏入职场生涯。性格原因，并不是特别适合销售行业，因此每个月业绩并不突出，经常挂蛋，也就是一部手机都没有销售出去。每天早10点晚10点，一月休息4天，这样的工作强度让我体会到生活的艰难，微薄的工资也只能够自己每个月的基本开销，难有结余。在恒波的3个月里，得到最大的收获就是让自己的胆量更大了点，经常在一天没有销量的情况下，举着广告牌，站在介绍对着过往的行人，大声喊着“双卡双待，音乐手机，只要99.”，很多时候就靠这99元的神机维持一天的销量。现在想想还是很好玩。
    很快，短短的三个月结束了。怀着对编程的喜爱，重新投入到招聘网站刷简历的行列中。然而，并没有像年前所想的那样，年后的机会会多很多，可能机会多只是对于那些经验丰富的人来说的，刚毕业的不入流大专生同样还是没有工作的机会。每天上午投简历，下午带着简历上门“霸面”，很多都是留了简历让回去等候消息，最后都不了了之。随着找工作的周期越来越长，依然看不到希望，身上的钱也越来越少，快到交不起房租的地步，最后在堂哥那里借了钱交了房租，也就顺便在他那里学习，从而接触到了android。

###川源信息：2013.4.1 - 2013.5.3
    未完待续。
